interIsoFoam/notchedDiscInSolidBodyRotation/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

application=$(getApplication)

restore0Dir

runApplication blockMesh

runApplication -s postProcess ${application} -postProcess -time 0

runApplication setAlphaField

runApplication setFields

runApplication ${application}

#------------------------------------------------------------------------------
